IDEA Open Model
CrossSectionFactory.FillColdFormedL Method
Compatible with IDEA StatiCa 20.1
 Fill parameters for cold formed L section
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static void FillColdFormedL(
	CrossSectionParameter css,
	double Width,
	double Height,
	double Thickness,
	double Radius
)
Public Shared Sub FillColdFormedL (
	css As CrossSectionParameter,
	Width As Double,
	Height As Double,
	Thickness As Double,
	Radius As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Width
Type: System.Double
Horizontal leg length
Height
Type: System.Double
Vertical leg length
Thickness
Type: System.Double
Thickness
Radius
Type: System.Double
Inside radius
Remarks
Dimension of cold formed L section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 9;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.10;
double Height = 0.10;
double Thickness = 0.003;
double Radius = 0.005;
CrossSectionFactory.FillColdFormedL(css, Width, Height, Thickness, Radius);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace